# AnalyticConstructionLookupTable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticConstructionLookupTable Property
ParameterTypeId Class See Also
---
"Analytic Construction"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticConstructionLookupTable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticConstructionLookupTable As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticConstructionLookupTable {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace